Revit 2026 API

# DefinitionGroupsGetEnumerator Method

---

Retrieves an enumerator to the collection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<DefinitionGroup> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of DefinitionGroup)
```
```cpp
public:
virtual IEnumerator<DefinitionGroup^>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<DefinitionGroup>
override GetEnumerator : unit -> IEnumerator<DefinitionGroup>
```

#### Return Value

IEnumeratorDefinitionGroupThe enumerator.

#### Implements

IEnumerableTGetEnumerator

#### Reference

DefinitionGroups Class

Autodesk.Revit.DB Namespace